test/load/artillery.yml
# Config file for artillery
#
# Install:
#   npm install -g artillery
#
# Run:
# Start server
#   artillery run artillery.yml --target=http://HOST:PORT
# If running on https with a self-signed certificate
#   artillery run artillery.yml --target=http://HOST:PORT -k
#
# Stats will be stored in a JSON file in cwd.


config:
  #target: 'http://localhost:8000'
  phases:
    - duration: 180
      arrivalRate: 50

scenarios:
  - name: 'view homepage'
    flow:
    - get:
        url: '/'
    - get:
        url: '/listTokens'
  - name: 'view homepage, create and revoke token'
    flow:
    - get:
        url: '/'
    - get:
        url: '/listTokens'
    - post:
        url: '/createToken'
        body: ''
        capture:
          json: '$.token'
          as: 'token'
    - post:
        url: '/revokeToken'
        json:
          token: '{{ token }}'